<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = 'Froppi'
</script>

<template>
  <div class="protocol">
    <div class="bt" style="text-align: center">
      {{ appName }}隐私政策
    </div>
    通过移动应用使用 {{ appName }} 可能会涉及对您信息的收集和使用。本隐私政策将说明并告知您，在您通过我们的移动应用访问和使用服务时，{{ appName }} 如何收集、使用和披露您的信息。了解本隐私政策以及您可以如何保护自己的信息，对您而言非常重要，因此请您仔细阅读本隐私政策。
    <br>
    <div class="bt">
      1.本隐私政策的适用范围
    </div>
    1.1 使用 {{ appName }} 即表示您同意我们可依据本隐私政策（及其不时修订的版本）访问、收集、使用和共享您的信息。此外，您对 {{ appName }} 的使用亦表明您同意本隐私政策的各项条款。如果您不同意本隐私政策的条款，请不要使用 {{ appName }}。
    <br><br>
    1.2 本隐私政策已并入您为使用 {{ appName }} 而同意的《{{ appName }} 服务条款》，并构成其组成部分。除非本隐私政策另有定义，或上下文另有要求，本隐私政策中使用的任何术语与《{{ appName }} 服务条款》中对应定义术语具有相同含义。除本隐私政策另有规定外，《{{ appName }} 服务条款》中的相关条款同样适用于本隐私政策。
    <br><br>
    1.3 任何被收集的信息均适用收集当时有效的隐私政策。但我们可能会不时修改和修订本隐私政策。如果我们对本政策作出我们认为属重大变更的调整，无论是否另行通知，您均同意受修订后政策的约束。
    <br><br>
    1.4 {{ appName }} 可能会链接至第三方提供的社交媒体或其他功能、服务（包括网站、插件和小部件）。请注意，本隐私政策不适用于通过我们的服务可访问的任何第三方网站、服务或应用所收集的信息，也不适用于在 {{ appName }} 上推广其服务的其他公司和组织所收集的信息。对于您提供给该等第三方的信息被其如何使用，我们不承担任何责任。
    <br><br>
    2. 在向您提供 {{ appName }} 服务时，我们会通过以下方式获取与您有关的信息。请注意，我们需要某些类型的信息，才能向您提供 {{ appName }} 服务。
    <br><br>
    1）用户提供的信息
    <br><br>
    2）基于合法利益自动收集的信息
    <br><br>
    用户提供的信息
    <br><br>
    1）您开设 {{ appName }} 账户时向我们提供的信息，包括您的昵称、性别、出生日期、国家、年龄、电子邮箱、密码、社交媒体账户信息（头像、视频）以及您发布的与您自身相关的任何标签；
    <br><br>
    2）您在 {{ appName }} 个人资料中包含的、其他 {{ appName }} 用户可见的任何信息，或您通过使用 {{ appName }} 向我们提供的信息，其中可能包括您的照片、性别；
    <br><br>
    3）用户生成内容（“UGC”），例如您在使用 {{ appName }} 服务过程中，于应用内上传、分发或直播的评论、文本、消息、图片、图像、视频、声音、代码或其他数据、资料；
    <br><br>
    4）支付信息，例如银行账号、PayPal 或其他用于付款的支付信息；
    <br><br>
    5）您购买付费服务后的交易信息，例如交易编号和交易记录；
    <br><br>
    6）您作出同意选择以及与我们沟通时提供的信息，例如用于验证您的账户、处理您的反馈或投诉的信息，以及您参与应用内调查和活动时提供的信息。
    <br><br>
    7）当您通过连接或关联第三方社交媒体账户（如 Facebook、Google）来创建 {{ appName }} 账户时，您通过该社交媒体向我们提供的信息；
    <br><br>
    2.基于合法利益自动收集的信息
    <br><br>
    ⊙ 您在其他服务上的账户数据：如果您的社交媒体或其他在线账户与您在我们服务中的账户相关联，我们可能会通过这些账户获取某些信息。如果您通过 Facebook 或其他第三方平台登录我们的服务，我们会请求您授权访问该账户中的某些信息。例如，根据平台或服务不同，我们可能会收集您的姓名、头像、性别、信息和出生日期，其中包括来自 Google 的信息：Google 账户唯一 ID、ID Token；来自 Facebook 的信息：AccessToken。这些平台和服务会通过其 API 向我们提供信息。我们接收到的信息取决于您决定通过隐私设置向我们提供的信息，或取决于相关平台或服务本身。如果您通过第三方平台或服务访问或使用我们的服务，或点击任何第三方链接，您的数据收集、使用和共享行为也将受该第三方的隐私政策及其他协议约束。
    <br><br>
    ⊙ 设备标识信息，例如您的操作系统、浏览器类型、品牌、型号和移动设备序列号、互联网协议（IP）地址、移动运营商、屏幕分辨率、语言设置、IMEI 号码、IMSI 号码以及 MAC 地址；
    <br><br>
    ⊙ 网络活动信息，例如您的浏览记录、搜索记录、您访问过的视频或页面、访问日期和时间、您关注的其他用户账户，以及您与其他用户互动的信息；
    <br><br>
    ⊙ 当服务发生崩溃或卡顿时，我们还会收集错误报告信息，以便调查错误并提升后续版本服务的稳定性。通常，这些报告不包含个人身份识别信息，或者仅偶然包含。在这些错误报告中，我们会接收有关您设备类型和版本、设备标识符、错误发生时间、当时使用的功能以及错误发生时应用状态的信息。除调查和修复错误外，我们不会将该等信息用于其他目的。
    <br><br>
    ⊙ 您访问和使用其他应用的信息；
    <br><br>
    ⊙ 与您向我们提供的 UGC 相关的元数据，用于描述其他数据，并提供有关 UGC 片段如何、何时、由谁收集，以及 UGC 格式的信息，例如用于标记视频关键词的主题标签和字幕；
    <br><br>
    我们还可能收集、使用和共享您的信息，以生成并共享无法识别您身份的汇总分析结果。聚合数据可能来源于您的个人信息，但由于该等数据不会直接或间接识别您的身份，因此不被视为个人信息。例如，我们可能会汇总您的使用数据，以计算访问某项网站功能的用户比例、生成用户统计信息，或统计广告展示或点击次数。
    <br><br>
    <div class="bt">
      2.关于敏感个人信息的特别说明
    </div>
    为提供某些功能（例如在线视频通话），经您授权后，我们必须访问您的麦克风和摄像头，具体如下：
    <br><br>
    1）麦克风：经您授权后，我们会访问您设备上的麦克风，用于录制语音消息并在视频通话过程中传输声音。
    <br><br>
    2）摄像头：经您授权后，我们会访问您设备上的摄像头，用于拍摄您的头像照片并在视频通话过程中传输实时画面。
    <br><br>
    使用 {{ appName }} 即表示您同意，所有对敏感个人信息的处理活动，均按照本隐私政策所述目的和方式进行。
    <br><br>
    请注意，除非获得您的同意，我们不会将您的敏感个人信息用于直接营销目的。
    <br><br>
    2.3 关于儿童信息的特别说明 {{ appName }} 的服务仅适用于年满 18 周岁的用户。我们不允许 18 周岁以下用户访问我们的平台，也不会在明知的情况下收集 18 周岁以下用户的个人信息。
    <br><br>
    <div class="bt">
      3.我们如何使用所收集的信息
    </div>
    我们仅会在以下情况下使用或可能披露您的个人信息：验证您的身份；
    <br><br>
    1）使您能够与本服务支持连接的其他用户建立联系；
    <br><br>
    2）在本服务中与其他人共享您的个人信息；
    <br><br>
    3）使您能够使用我们不时提供的某些服务功能；向您显示您正在沟通对象的姓名，并在服务中显示该等信息；
    <br><br>
    4）向您发送与您使用本服务相关的管理通知、提醒及通信信息；
    <br><br>
    5）向您提供您允许我们收集的信息，或您向与 {{ appName }} 账户关联的社交媒体服务提供商提供的信息所对应的相关内容，例如有关您位置及 {{ appName }} 联系人位置的信息；
    <br><br>
    6）通过电子邮件、短信或其他方式联系您，通知您新的产品、服务或促销信息；用于内部运营，包括故障排查、数据分析、测试、研究、服务改进，以及识别和防止错误、欺诈或其他违法活动；
    <br><br>
    7）当我们真诚相信法律、任何法律程序、执法、国家安全或公共利益事项要求披露时；为保护和维护我们的权利或财产（包括执行我们的使用条款及其他协议）；或
    <br><br>
    8）与涉及 {{ appName }} 的公司交易有关，例如业务单元的购买或出售、收购、合并、资产出售或其他类似事项。
    <br><br>
    {{ appName }} 允许您在应用中与其他用户分享文本消息、照片、截图、视频及其他通信内容；如果您选择这样做，您的文本消息、照片、截图、视频及其他通信内容将被存储在我们的服务器上。此外，如果您选择与其他 {{ appName }} 用户共享这些内容，我们可能无法将其从服务器中删除，也无法阻止您已分享对象继续访问这些内容。在 {{ appName }} 应用中发送和分享文本消息、照片、截图、视频或其他通信内容是您自己的决定。选择分享该等信息即表示您理解，您可能无法再控制这些信息如何被使用，并且这些信息可能会公开可见（这在一定程度上取决于您的行为或与您共享信息的其他人的行为）。对于您分享信息的任何使用或滥用，{{ appName }} 不承担责任。
    <br><br>
    3.2 传输与存储
    <br><br>
    我们目前并可能持续在全球多个司法辖区运营服务器，因此，使用和存储您个人信息的服务器可能并不位于您所在的司法辖区。
    <br><br>
    您同意，为实现本隐私政策所述目的，您的个人信息可在您所在司法辖区内外进行传输。
    <br><br>
    3.3 分析
    <br><br>
    我们使用您信息的主要原因是提供并改进我们的服务。此外，我们还会利用您的信息帮助保障您的安全。以下将进一步说明我们使用您信息的不同原因及实际示例。
    <br><br>
    1）第三方使用分析工具：我们在服务中使用 Google Inc（1600 Amphitheatre Parkway, Mountain View, CA 94043, USA，“Google”）提供的工具进行使用分析。我们使用由 Google 收购的 Firebase 工具来衡量使用情况。由 Google 运营的 Firebase 也会用于使用分析目的。
    <br><br>
    2）第三方转化跟踪工具：AppsFlyer、Google conversion tracking API 及 Facebook Conversion tracking API，用于用户转化跟踪。
    <br><br>
    3）崩溃检测工具：我们使用 Firebase 旗下的 Crashlytics 工具进行崩溃检测。该工具有助于维护和改进服务。您的所有崩溃数据均以匿名方式收集。
    <br><br>
    3.4 共享您的信息
    <br><br>
    您的信息将通过以下方式与他人共享：在我们的产品中进行共享
    <br><br>
    1）未经您的同意，我们不会将您的信息出租或出售给第三方（或 {{ appName }} 所属公司集团中的公司），但本隐私政策另有说明、我们可与之共享您信息的对象除外：
    <br><br>
    2）我们可能会将用户内容及您的信息（包括但不限于来自 Cookie、日志文件、设备标识符、位数据及使用数据的信息）共享给 {{ appName }} 公司集团中依法属于同一集团的企业，或与其整合为同一企业集团（“关联公司”）。关联公司可使用这些信息来帮助提供、理解和改进本服务（包括提供分析）及其自身服务（包括为您提供更优、更相关的体验）。但这些关联公司将尊重您对“谁可以查看您的内容”所作出的选择。
    <br><br>
    3）我们还可能将您的信息，以及来自 Cookie、日志文件、设备标识符和位置数据等工具的信息，与帮助我们向您提供服务的第三方机构（“服务提供商”）共享。我们的服务提供商仅会在合理保密条款约束下，为提供服务之目的而获得访问您信息的权限。
    <br><br>
    4）我们还可能与第三方（包括广告商和投资者）共享聚合信息或匿名信息。例如，我们可能会告知广告商本应用拥有多少用户。该等信息不包含任何个人信息或可识别个人身份的信息，并将用于开发我们希望您感兴趣的内容和服务。
    <br><br>
    5）我们可能会删除可识别您身份的部分数据，并与其他方共享去标识化数据。我们也可能以不再与您相关联的方式将您的信息与其他信息结合，并共享该等聚合信息；同时，您可以自行选择与哪些对象共享您的用户内容：
    <br><br>
    6）您自愿披露并发布到本服务中的任何信息或内容（例如用户内容）都将向公众开放。使用该功能后，一旦您分享用户内容或将其公开，该等用户内容可能被他人再次分享；
    <br><br>
    7）如果您删除您在本服务中创建的信息和内容（例如截图等），副本仍可能在本服务的缓存和归档页面中可见；如果其他用户或第三方（例如 Facebook 等）已复制或保存该等信息，也可能继续保留。
    <br><br>
    3.5 我们为保护您的信息所采取的安全措施
    <br><br>
    我们采取行政、物理和电子措施，以保护您的信息免遭未经授权的访问。但尽管作出了这些努力，任何安全措施都不可能做到绝对完善或不可突破，任何数据传输方式也无法保证不会遭到拦截或其他形式的滥用。如您的个人信息因安全漏洞而受到侵害，我们将按照适用法律要求，在您的个人信息遭到泄露时及时通知您。
    <br><br>
    如我们确需与任何第三方共享您的个人信息，我们将尽合理努力确保该等第三方仅在以下条件下使用您的个人信息：
    <br><br>
    （i）遵守本隐私政策；
    <br><br>
    （ii）遵从我们向其发出的其他指示，包括我们实施的任何适当保密和安全措施。
    <br><br>
    <div class="bt">
      4.如何访问您的信息
    </div>
    您可以通过您的账户访问并修改您向我们提供的信息。
    <br><br>
    如果您认为您发布在 {{ appName }} 上的信息不真实或不准确，并能向我们提供合理证明，您可以通过本隐私政策中提供的联系方式要求我们更正该等不真实或不准确的信息，我们将尽合理努力满足您的请求；但根据法律要求和/或出于记录保存目的，我们可能保留您的信息归档副本。
    <br><br>
    一旦您的账户被关闭或删除，您将无法再访问您的消息记录、偏好设置或任何与您使用我们服务相关的其他信息。即使您已从账户或个人资料中移除相关信息，只要这些信息已与他人共享、依据您的隐私设置被分发，或被其他用户复制或存储，其副本仍可能在其他地方可见。此外，即使您已关闭账户，如为履行我们的法律义务（包括执法要求）、满足监管要求、解决争议、维护安全、防止欺诈和滥用，或执行服务条款而有合理必要，我们仍会保留您的个人数据。在您的账户关闭后，我们也会保留去标识化信息。
    <br><br>
    在某些情况下，我们可能无法更新、修改或删除您的个人信息。届时我们会告知您无法这样做的原因，例如某些请求可能需要付出不相称的技术成本、在实践中极不现实，或为法律所禁止。
    <br><br>
    由于 {{ appName }} 将在多个司法辖区内使用，我们可能无法识别本隐私政策某些条款与您所在司法辖区适用法律之间的全部不一致之处，因此，如您发现此类不一致，您同意及时通知我们。在此情况下，我们将采取必要措施消除此类不一致，包括删除由我们不当收集或使用的相关个人信息。
    <br><br>
    <div class="bt">
      5.数据访问与删除
    </div>
    对于您选择在本服务中与我们共享哪些信息，您始终拥有控制权。为此，您可以更改服务中的设置或移动设备上的设置。或者，您也可以从移动设备中彻底删除本服务，并且您可以随时删除您的数据。如您要求我们删除您的账户，我们将尽商业上合理的努力从服务器中删除您的数据。
    <br><br>
    您通过 {{ appName }} 应用与其他用户共享的文本消息、照片、视频或任何其他可识别个人身份的信息，或您在我们网站或其他地方的博客、公告板或聊天室中提交的信息，都可能被他人查看和使用，其中包括向您发送未经请求的信息或实施身份盗用。对于因您披露信息而导致您的信息被使用或滥用，{{ appName }} 不承担责任。
    <br><br>
    <div class="bt">
      6.安全
    </div>
    保护用户隐私和个人信息是 {{ appName }} 的首要任务，我们已作出重大努力，以确保您向我们提供的所有可识别个人身份信息的隐私安全。所有可识别个人身份信息的访问权限仅限于为了提供、运营、开发、维护和支持服务而确有必要知悉该等信息的 {{ appName }} 员工、承包商、代理人及第三方服务提供商。
    <br><br>
    <div class="bt">
      7.年龄
    </div>
    本服务并非面向十八（18）岁以下儿童，我们不会在明知的情况下接收或出售十八岁以下儿童的可识别个人身份信息作为本服务的一部分。如果我们发现曾无意中在服务中接收了 18 岁以下用户的可识别个人身份信息，我们将从记录中删除该等信息。如果我们未来变更相关做法，在作为服务一部分收集任何 18 岁以下儿童的可识别个人身份信息之前，我们将事先取得可核实的父母同意。
    <br><br>
    <div class="bt">
      8.变更通知
    </div>
    我们保留自行决定修改本隐私政策的权利。您可随时通过我们网站上的链接查看隐私政策更新。您同意接受 {{ appName }} 发布的电子简报和/或修订后的隐私政策，并同意该等电子通信或公告构成我们向您发出的隐私政策通知。我们保留不时修订本政策的权利，因此请您经常查阅。如果我们对本政策作出重大变更，我们将通过发布修订后的隐私政策、在网站上发布通知或依照法律要求的方式通知您。您同意定期查看本隐私政策，以便了解任何变更。您同意，在我们发布修订后的隐私政策或在网站上发出通知后，您继续使用本服务即表示您接受修订后的隐私政策。如果您不同意本隐私政策的条款，则不应使用本服务。
    <br><br>
    <div class="bt">
      9.联系我们
    </div>
    如果您对我们的隐私政策或任何与隐私相关的事项有任何疑问，请通过电子邮箱【{{ appName }}@{{ appName }}.site】联系我们。
    <br><br>
  </div>
</template>

<style scoped>
  .protocol {
    font-size: 14px;
    margin-bottom: 14px;
    color: #000;
    margin-left:6px;
    margin-right:6px;
    background-color: #fff;
  }
  .bt {
    font-size: 20px;
    margin: 6px 0px;
    color: #7f1146;
  }
</style>
