<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = 'きずな'
</script>

<template>
  <div class="protocol">
    <div class="bt" style="text-align: center">
      {{ appName }}のプライバシーポリシー
    </div>
    モバイルアプリを通じた {{ appName }} の利用には、お客様の情報の収集および利用が含まれる場合があります。本プライバシーポリシーは、お客様が当社のモバイルアプリを通じて当社サービスにアクセスし利用する際に、{{ appName }} がお客様の情報をどのように収集、利用および開示するかについて説明し、お知らせするものです。本プライバシーポリシーおよびお客様の情報をどのように保護できるかを理解することは重要ですので、本プライバシーポリシーをよくお読みください。
    <br>
    <div class="bt">
      1. 本プライバシーポリシーの適用範囲
    </div>
    1.1 {{ appName }} を利用することにより、お客様は、当社が本プライバシーポリシー（随時改訂される場合があります）に従って、お客様の情報にアクセスし、収集し、利用し、共有することに同意するものとします。また、{{ appName }} の利用は、お客様が本プライバシーポリシーの条項に同意したことを意味します。本プライバシーポリシーの条項に同意されない場合は、{{ appName }} を利用しないでください。
    <br><br>
    1.2 本プライバシーポリシーは、{{ appName }} を利用するためにお客様が同意した {{ appName }} 利用規約に組み込まれ、その一部を構成します。本プライバシーポリシーで使用される用語は、本プライバシーポリシーで別途定義されている場合または文脈上別異に解すべき場合を除き、{{ appName }} 利用規約における対応する定義語と同一の意味を有します。本プライバシーポリシーに別段の定めがない限り、{{ appName }} 利用規約の各条項は本プライバシーポリシーにも適用されます。
    <br><br>
    1.3 収集されるあらゆる情報は、その情報が収集された時点で有効なプライバシーポリシーに従います。ただし、当社は随時、本プライバシーポリシーを変更または改訂する場合があります。当社が本ポリシーに重大と判断する変更を行った場合、通知の有無にかかわらず、お客様は改訂後のポリシーに拘束されることに同意するものとします。
    <br><br>
    1.4 {{ appName }} は、お客様を第三者が提供するソーシャルメディアまたはその他の機能もしくはサービス（ウェブサイト、プラグイン、ウィジェットを含みます）にリンクする場合があります。本プライバシーポリシーは、当社サービスを通じてアクセス可能な第三者のウェブサイト、サービスまたはアプリケーションによって収集される情報には適用されず、{{ appName }} 上で自らのサービスを宣伝する他の会社や組織によって収集される情報にも適用されません。お客様がこれらの第三者に提供した情報の第三者による利用について、当社は一切責任を負いません。
    <br><br>
    2. 当社は、{{ appName }} サービスを提供する際に、以下に説明する方法でお客様に関する情報を取得します。{{ appName }} サービスをお客様に提供するためには、一定の種類の情報が必要であることにご注意ください。
    <br><br>
    1). ユーザー提供情報
    <br><br>
    2). 正当な利益のために自動的に収集される情報
    <br><br>
    ユーザー提供情報
    <br><br>
    1) {{ appName }} アカウントを開設する際に当社に提供される情報。これには、ニックネーム、性別、生年月日、国、年齢、メールアドレス、パスワード、ソーシャルメディアアカウント情報（プロフィール写真、動画）、およびお客様自身について投稿したあらゆるタグが含まれます。
    <br><br>
    2) 他の {{ appName }} ユーザーに表示されるお客様の {{ appName }} プロフィールに含まれる情報、または {{ appName }} の利用を通じて当社に提供される情報。これにはお客様の写真や性別が含まれる場合があります。
    <br><br>
    3) ユーザー生成コンテンツ（「UGC」）。これには、{{ appName }} サービスの利用中に、アプリケーション上でお客様がアップロード、配布または配信するコメント、テキスト、メッセージ、写真、画像、動画、音声、コード、その他のデータまたは素材が含まれます。
    <br><br>
    4) 銀行口座番号、PayPal、その他の支払いに必要な支払情報などの決済情報。
    <br><br>
    5) 有料サービス購入後の取引番号や取引履歴などの取引情報。
    <br><br>
    6) お客様による同意内容および当社との連絡に関する情報。これには、お客様のアカウント確認やフィードバックもしくは苦情への対応に使用される情報、ならびにアプリ内アンケートやアクティビティへの参加時にお客様が提供する情報が含まれます。
    <br><br>
    7) 第三者のソーシャルメディアアカウント（例：Facebook、Google）と {{ appName }} アカウントを接続または関連付けて {{ appName }} アカウントを作成する際に、ソーシャルメディアからお客様が提供する情報。
    <br><br>
    2. 正当な利益のために自動的に収集される情報
    <br><br>
    ⊙ 他サービス上のお客様のアカウントに関するデータ：お客様のソーシャルメディアまたはその他のオンラインアカウントが当社サービス上のアカウントと関連付けられている場合、当社は当該アカウントを通じて一定の情報を取得することがあります。お客様が Facebook またはその他の第三者プラットフォームを通じて当社サービスにログインする場合、当社は当該アカウントに関する一定の情報へのアクセス許可を求めます。たとえば、プラットフォームまたはサービスに応じて、当社は氏名、プロフィール画像、性別、情報、生年月日を収集する場合があり、Google からは Google アカウントの一意 ID、ID トークン、Facebook からは AccessToken などの情報が含まれます。これらのプラットフォームおよびサービスは、それぞれの API を通じて当社に情報を提供します。当社が受け取る情報は、お客様が当社に提供することを選択した情報（プライバシー設定を通じたもの）または当該プラットフォームもしくはサービスによって異なります。お客様が第三者のプラットフォームもしくはサービスを通じて当社サービスにアクセスまたは利用する場合、または第三者リンクをクリックする場合、お客様のデータの収集、利用および共有は、当該第三者のプライバシーポリシーおよびその他の契約にも従うものとします。
    <br><br>
    ⊙ お客様のオペレーティングシステム、ブラウザの種類、ブランド、モデル、モバイル端末のシリアル番号、インターネットプロトコル（IP）アドレス、携帯通信事業者、画面解像度、言語設定、IMEI 番号、IMSI 番号、MAC アドレスなどの端末識別情報。
    <br><br>
    ⊙ 閲覧履歴、検索履歴、訪問した動画またはページ、訪問日時、フォローした他のユーザーアカウント、他のユーザーとのやり取りに関する情報などのネットワーク活動情報。
    <br><br>
    ⊙ サービスがクラッシュまたはハングアップした場合、当社はエラーを調査し、今後のリリースにおけるサービスの安定性を向上させるため、エラーレポート情報も収集します。通常、これらのレポートには個人を特定できる情報は含まれないか、含まれるとしても偶発的なものです。これらのエラーレポートの一環として、当社はお客様の端末の種類およびバージョン、端末識別子、エラー発生時刻、使用中の機能、エラー発生時のアプリケーションの状態に関する情報を受け取ります。当社は、この情報をエラーの調査および修正以外の目的で使用しません。
    <br><br>
    ⊙ お客様による他のアプリケーションへのアクセスおよび利用に関する情報。
    <br><br>
    ⊙ お客様が当社に提供する UGC に関連付けられたメタデータ。これは他のデータを記述し、UGC クリップがどのように、いつ、誰によって収集されたか、また動画キーワードのタグ付けに使用されるトピックタグや字幕など、UGC の形式に関する情報を提供します。
    <br><br>
    当社はまた、お客様を特定しない要約インサイトを生成および共有するために、お客様の情報を収集、利用および共有する場合があります。集計データはお客様の個人情報から導出される場合がありますが、そのデータがお客様を直接または間接に特定しないため、個人情報とはみなされません。たとえば、当社はお客様の利用データを集計して、特定のサイト機能を訪問したユーザーの割合を算出したり、ユーザーに関する統計を生成したり、特定機能への訪問割合を計算したり、表示またはクリックされた広告数を算出したりする場合があります。
    <br><br>
    <div class="bt">
      2. センシティブな個人情報に関する特別な注意
    </div>
    特定の機能（例：オンラインビデオ通話）を提供するため、当社は以下のとおり、お客様の許可を得てマイクおよびカメラにアクセスする必要があります。
    <br><br>
    1) マイク：当社は、お客様の許可を得たうえで端末のマイクにアクセスし、音声メッセージの録音およびビデオ通話中の音声伝送を行います。
    <br><br>
    2) カメラ：当社は、お客様の許可を得たうえで端末のカメラにアクセスし、プロフィール写真の撮影およびビデオ通話中のリアルタイム画像の送信を行います。
    <br><br>
    {{ appName }} を利用することにより、お客様は、センシティブな個人情報に関するすべての処理活動が、本プライバシーポリシーに記載された目的および方法に従って行われることに同意するものとします。
    <br><br>
    お客様の同意がない限り、当社はお客様のセンシティブな個人情報をダイレクトマーケティングの目的で使用しないことにご留意ください。
    <br><br>
    2.3 子どもの情報に関する特別な注意 {{ appName }} のサービスは、18 歳以上のユーザーのみに適用されます。当社は 18 歳未満のユーザーによる当社プラットフォームへのアクセスを認めず、18 歳未満のユーザーの個人情報を故意に収集することはありません。
    <br><br>
    <div class="bt">
      3. 当社が収集した情報の利用方法
    </div>
    当社は、以下の場合にのみお客様の個人情報を利用し、または開示することがあります。お客様の本人確認を行うこと。
    <br><br>
    1) 本サービスにより可能となる他の利用者との接続を行うこと。
    <br><br>
    2) 本サービス上でお客様の個人情報を他者と共有すること。
    <br><br>
    3) 随時提供される可能性のある特定のサービス機能をお客様が利用できるようにすること。お客様がやり取りしている相手の名前を表示し、サービス上でその相手の名前を示すこと。
    <br><br>
    4) お客様のサービス利用に関連する各種管理通知、アラートおよび連絡を送信すること。
    <br><br>
    5) お客様が当社による収集を許可した情報、または {{ appName }} アカウントに関連付けられたソーシャルメディア提供者にお客様が提供した情報に基づき、お客様が要求した関連コンテンツ（たとえば、お客様の位置情報や {{ appName }} 上の連絡先の位置情報など）を提供すること。
    <br><br>
    6) 電子メール、テキストメッセージその他の手段により、お客様に新製品、サービスまたはプロモーションを通知すること。ならびに、トラブルシューティング、データ分析、テスト、調査、サービス向上、エラー、不正またはその他違法行為の検知および防止を含む内部運営を実施すること。
    <br><br>
    7) 法律、法的手続、法執行、国家安全保障または公共の重要事項により開示が必要であると当社が誠実に判断した場合、当社の権利または財産を保護・防御するため（当社の利用条件およびその他の契約を執行する場合を含みます）に開示すること。
    <br><br>
    8) {{ appName }} に関する企業取引、たとえば事業部門の購入または売却、買収、合併、資産売却その他これらに類する事象に関連すること。
    <br><br>
    {{ appName }} では、アプリケーション内でテキストメッセージ、写真、スクリーンショット、動画その他の通信内容を他のユーザーと共有することができます。お客様がこれを選択した場合、これらのテキストメッセージ、写真、スクリーンショット、動画その他の通信内容は当社サーバーに保存されます。さらに、お客様がこれらの項目を他の {{ appName }} ユーザーと共有した場合、当社はそれらを当社サーバーから削除したり、お客様が共有した相手に対して利用できない状態にしたりできない場合があります。{{ appName }} アプリケーション内でテキストメッセージ、写真、スクリーンショット、動画その他の通信内容を送信および共有するかどうかは、お客様ご自身の判断によるものです。当該情報を共有することを選択した場合、お客様は、その情報がどのように利用されるかをもはや管理できなくなる可能性があり、また公開される可能性があることを理解する必要があります（これは一部、お客様ご自身の行動またはお客様が情報を共有した相手方の行動に依存します）。{{ appName }} は、お客様が共有した情報の利用または誤用について一切責任を負いません。
    <br><br>
    3.2 移転および保存
    <br><br>
    当社は世界各地の複数の法域においてサーバーを運営しており、今後も運営を継続する場合があります。そのため、お客様の個人情報が利用および保存されるサーバーは、お客様の法域内に所在しない場合があります。
    <br><br>
    お客様は、本プライバシーポリシーに記載された目的のために、お客様の個人情報が法域の内外に移転されることに同意するものとします。
    <br><br>
    3.3 分析
    <br><br>
    当社がお客様の情報を利用する主な理由は、サービスを提供し改善するためです。また、当社はお客様の安全確保のためにもお客様の情報を利用します。以下では、お客様の情報を利用するさまざまな理由と実際の例について、さらにご説明します。
    <br><br>
    1) 第三者の利用分析ツール：当社は、Google Inc（1600 Amphitheatre Parkway, Mountain View, CA 94043, USA, “Google”）が提供するツールを、当社サービスにおける利用分析のために使用します。Google が取得した Firebase のツールを利用状況の測定に使用しており、Google が運営する Firebase も利用分析の目的で使用されます。
    <br><br>
    2) 第三者のコンバージョントラッキングツール：AppsFlyer、Google conversion tracking API および Facebook Conversion tracking API を、ユーザーのコンバージョントラッキングのために使用します。
    <br><br>
    3) クラッシュ検知ツール：当社は、Firebase が提供する Crashlytics ツールをクラッシュ検知のために使用しています。これはサービスの維持および改善に役立ちます。お客様のクラッシュデータはすべて匿名で収集されます。
    <br><br>
    3.4 お客様の情報の共有
    <br><br>
    お客様の情報は、以下の方法により他者と共有されます：当社製品上での共有
    <br><br>
    1) お客様の同意なく、当社は、お客様の情報を第三者（または {{ appName }} が属する企業グループ）に賃貸または販売しません。ただし、本プライバシーポリシーで別途定める場合を除きます。当社がお客様の情報を共有する相手先は以下のとおりです。
    <br><br>
    2) 当社は、ユーザーコンテンツおよびお客様の情報（Cookie、ログファイル、端末識別子、ビットデータおよび利用データから得られる情報を含みますが、これらに限られません）を、{{ appName }} の企業グループに法的に属する事業体（以下「関連会社」）と共有する場合があります。関連会社は、サービス（分析の提供を含みます）および自らのサービス（より良く、より関連性の高い体験を提供することを含みます）を提供、理解および改善するためにこれらの情報を利用する場合があります。ただし、これらの関連会社は、お客様のコンテンツを誰が閲覧できるかについてお客様が行った選択を尊重します。
    <br><br>
    3) 当社はまた、お客様にサービスを提供する支援を行う第三者機関（以下「サービスプロバイダー」）と、お客様の情報および Cookie、ログファイル、端末識別子、位置情報などのツールから得られる情報を共有する場合があります。当社のサービスプロバイダーは、合理的な秘密保持条件のもとでサービスを提供するために、お客様の情報へのアクセス権を付与されます。
    <br><br>
    4) 当社は、広告主や投資家を含む第三者と、集計情報または匿名情報を共有する場合もあります。たとえば、当社は広告主に対し、本アプリのユーザー数を知らせることがあります。これらの情報には個人情報または個人を特定し得る情報は含まれず、お客様の関心を引くと当社が考えるコンテンツおよびサービスを開発するために使用されます。
    <br><br>
    5) 当社は、お客様を特定できる一部のデータを削除したうえで、その匿名化データを他者と共有する場合があります。また、お客様の情報を、お客様と結び付かない形で他の情報と組み合わせ、この集計情報を共有する場合があります。さらに、お客様は、自身のユーザーコンテンツを共有する相手を選択することができます。
    <br><br>
    6) ユーザーコンテンツなど、お客様が自発的に開示して本サービス上に公開したあらゆる情報またはコンテンツは、一般公開されます。この機能により、{{ appName }} は過度な要求の集中を防ぐことができます。いったんお客様がユーザーコンテンツを共有し、または公開した場合、そのユーザーコンテンツは他者によって再共有される可能性があります。
    <br><br>
    7) お客様が本サービス上で作成した情報およびコンテンツ（たとえばスクリーンショット等）を削除した場合でも、そのコピーが本サービスのキャッシュまたはアーカイブページに残って表示される場合があり、また他のユーザーまたは第三者（たとえば Facebook 等）がその情報を複製または保存している場合があります。
    <br><br>
    3.5 お客様の情報を保護するために当社が講じる安全対策
    <br><br>
    当社は、お客様の情報を不正アクセスから保護するための管理的、物理的および電子的措置を講じています。しかしながら、これらの努力にもかかわらず、いかなる安全対策も完全または突破不可能ではなく、いかなるデータ送信方法も傍受その他の不正利用を完全に防ぐことは保証できません。お客様の個人情報がセキュリティ侵害の結果として侵害された場合、適用法により求められるときは、当社は速やかにその旨をお客様に通知します。
    <br><br>
    当社がお客様の個人情報を第三者と共有する場合、当社は、当該第三者がお客様の個人情報を以下に限って使用するよう合理的な努力を尽くします。
    <br><br>
    (i) 本プライバシーポリシーを遵守すること。
    <br><br>
    (ii) 当社が与えるその他の指示（当社が実施する適切な秘密保持および安全対策を含みます）に従うこと。
    <br><br>
    <div class="bt">
      4. お客様の情報へのアクセス方法
    </div>
    お客様は、ご自身のアカウントを通じて、当社に提供した情報へアクセスし、これを修正することができます。
    <br><br>
    お客様が {{ appName }} 上に掲載した情報が真正または正確でないと考え、その点について合理的な証拠を当社に提供できる場合、お客様は本プライバシーポリシーに記載された連絡先を通じて、当社に対し当該真正でないまたは不正確な情報の訂正を求めることができます。当社は合理的な努力をもってお客様の要請に応じますが、法令上の要求または記録保存の目的により、お客様の情報のアーカイブコピーを保持する場合があります。
    <br><br>
    お客様のアカウントが閉鎖または削除されると、お客様はメッセージ履歴、設定内容、その他当社サービスの利用に関連する情報にアクセスできなくなります。お客様がアカウントまたはプロフィールから情報を削除した後であっても、その情報が他者と共有されていた場合、お客様のプライバシー設定に従って配布されていた場合、または他のユーザーによって複製もしくは保存されていた場合には、そのコピーが他の場所で閲覧可能なままであることがあります。さらに、当社は、法的義務の履行（法執行機関からの要請を含みます）、規制要件への対応、紛争解決、安全維持、不正および濫用の防止、または利用規約の執行のために合理的に必要な場合、お客様がアカウントを閉鎖した後であってもお客様の個人データを保持します。当社は、アカウント閉鎖後も匿名化された情報を保持します。
    <br><br>
    場合によっては、当社がお客様の個人情報を更新、修正または削除できないことがあります。その場合、当社は、なぜそれができないのかをお知らせします。たとえば、一定の要請には不釣り合いな技術的労力を要する場合、実務上きわめて困難である場合、または法令により禁止されている場合があります。
    <br><br>
    {{ appName }} は複数の法域で利用されるため、本プライバシーポリシーの一部条項とお客様の法域における適用法との不一致を、当社がすべて把握できない場合があります。したがって、お客様は、そのような不一致を発見した場合、当社に通知することに同意するものとします。この場合、当社は当該不一致を解消するために必要な措置を講じます。これには、当社が不適切に収集または使用した個人情報の削除が含まれます。
    <br><br>
    <div class="bt">
      5. データへのアクセスおよび削除
    </div>
    お客様は、本サービス上で当社と共有する情報について常に選択・管理することができます。そのためには、サービス内またはモバイル端末上の設定を変更することができます。あるいは、お客様は本サービスをモバイル端末から完全に削除することができ、またいつでもご自身のデータを削除することができます。お客様が当社にアカウント削除を要求した場合、当社は商業上合理的な努力をもって、当社サーバーからお客様のデータを削除します。
    <br><br>
    お客様が {{ appName }} アプリを通じて他のユーザーと共有するテキストメッセージ、写真、動画、またはその他の個人を特定し得る情報、あるいは当社ウェブサイトその他の場所におけるブログ、掲示板またはチャットルームに投稿する情報は、他者に閲覧され利用される可能性があります。これには、迷惑メッセージの送信やなりすまし被害などが含まれます。{{ appName }} は、お客様の情報の開示に起因する、お客様の情報のいかなる利用または誤用についても責任を負いません。
    <br><br>
    <div class="bt">
      6. セキュリティ
    </div>
    ユーザーのプライバシーおよび個人情報の保護は {{ appName }} における最優先事項であり、当社は、お客様が当社に提供するすべての個人識別情報のプライバシーを確保するために多大な努力を払っています。すべての個人識別情報へのアクセスは、サービスを提供、運営、開発、保守およびサポートするために当該情報を知る必要のある {{ appName }} の従業員、請負業者、代理人および第三者サービス提供者に限定されます。
    <br><br>
    <div class="bt">
      7. 年齢
    </div>
    本サービスは 18 歳未満の子どもを対象としていません。また、当社は、18 歳未満の子どもから個人を特定できる情報を、故意に取得または販売することはありません。万一、当社サービスにおいて 18 歳未満のユーザーから個人識別情報を意図せず受領したことが判明した場合、当社は当該情報を当社の記録から削除します。今後、当社の運用を変更し、サービスの一環として 18 歳未満の子どもから個人識別情報を収集する必要が生じた場合には、事前に確認可能な保護者の同意を取得します。
    <br><br>
    <div class="bt">
      8. 変更通知
    </div>
    当社は、本プライバシーポリシーを当社の裁量により変更する権利を留保します。お客様は、当社ウェブサイト上のリンクを通じて、当社のプライバシーポリシーの更新内容をいつでも確認することができます。お客様は、{{ appName }} の電子ニュースレターおよび/または改訂後のプライバシーポリシーの掲載を受け入れることに同意し、また、そのような電子的な連絡または掲載がお客様に対するプライバシーポリシーの通知を構成することに同意するものとします。当社は本ポリシーを随時改訂する権利を留保しますので、定期的にご確認ください。当社が本ポリシーに重大な変更を加える場合、改訂後のプライバシーポリシーの掲載、当社ウェブサイト上の通知、または法的要件に従った方法によりお客様に通知します。お客様は、本プライバシーポリシーを定期的に確認し、変更内容を把握することに同意するものとします。当社が改訂後のプライバシーポリシーを掲載し、または当社ウェブサイト上で通知を行った後にお客様が引き続き本サービスを利用した場合、お客様は改訂後のプライバシーポリシーを承諾したものとみなされます。本プライバシーポリシーの条項に同意されない場合は、本サービスを利用しないでください。
    <br><br>
    <div class="bt">
      9. お問い合わせ
    </div>
    当社のプライバシーポリシーまたはプライバシーに関連する事項についてご不明な点がある場合は、【{{ appName }}@{{ appName }}.site】までメールでお問い合わせください。
    <br><br>
  </div>
</template>

<style scoped>
  .protocol {
    font-size: 14px;
    margin-bottom: 14px;
    color: #000;
    margin-left:6px;
    margin-right:6px;
    background-color: #fff;
  }
  .bt {
    font-size: 20px;
    margin: 6px 0px;
    color: #7f1146;
  }
</style>
