<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = 'きずな'
</script>

<template>
  <div class="agreement">
    <div class="T_title" style="text-align: center">
      {{ appName }} 利用規約
    </div>
    <div class="T_content">
      ご登録の前に、本利用規約（以下「本規約」といいます）をよく読み、十分にご理解いただくようお願いいたします。

      本規約は、各当事者の権利義務を明確にし、各当事者の適法な権益を保護するために定められています。本規約において太字下線で強調されている内容は、お客様に特に注意を促すものです。本規約を十分にご理解いただいたうえでご利用ください。お客様は、本規約のすべてに同意しない限り、当社のサービスまたはソフトウェア（以下「サービス」「ソフトウェア」といいます）に登録、ログイン、または利用することはできません。お客様の登録、ログイン、利用等の行為は、本規約を承諾し、その拘束を受けることに同意したものとみなされます。

      当社は、自己の裁量により、本規約、補足規約、プライバシーポリシー、規制条項または機能条項の全部または一部を、事前通知なく、ソフトウェアまたはサービス内に改訂版を掲載することにより、いつでも変更、修正、追加または削除する権利を留保します。これらの条項または将来の改訂版に同意されない場合は、当社サービスにアクセスまたは利用してはなりません。これに反し、お客様が当社サービスにアクセスし、または利用した場合、将来の更新版に同意したものとみなされます。
    </div>
    <div class="T_title">
      1. アカウント
    </div>
    <div class="T_content">
      1.1 当社サービスを利用するために、当社はお客様にアカウントの作成を求め、またはお客様にアカウント（以下「アカウント」といいます）を割り当てる場合があります。当社は、お客様のアカウント登録方法を変更することができます。
      <br><br>
      1.2 お客様は、本アカウントの登録に際して、当社が当社の他のサービス用のアカウントを有効化することを同時に承認するものとします。具体的な製品は、当社の実際の運営状況によるものとします。
      <br><br>
      1.3 アカウントの所有権は当社に帰属し、お客様はアカウントの使用権のみを有します。お客様は、アカウントを贈与、貸与、賃貸、譲渡または販売してはなりません。
      <br><br>
      1.4 お客様は、ご自身のアカウントの安全を維持する責任を負います。お客様の不適切な管理によりアカウントの不正アクセスまたはパスワード盗難が発生した場合、その責任はすべてお客様が負うものとします。当社は、お客様のアカウントを通じて行われたすべての行為を、お客様ご本人が行ったものとして取り扱います。したがって、お客様は、ご自身のアカウントを使用して行われたすべての行為について責任を負うものとします。お客様が、ご自身のアカウントまたはアカウントのパスワードの実際の不正使用またはその疑いを認識した場合は、直ちに当社に通知してください。お客様は、いかなる場合においても、他のユーザーのアカウントまたはパスワードを使用しないことに同意するものとします。
      <br><br>
      1.5 お客様は、本規約の条項を遵守し、ソフトウェアを正しく適切に使用しなければなりません。お客様が本規約のいずれかの条項に違反した場合、当社は、お客様に対するサービスの提供を停止または終了する権利を留保します。
      <br><br>
      1.6 お客様のアカウントに関して 1 年間何らの活動も行われない場合、当社は、資源の無駄を避けるため、事前通知なく当該アカウントを削除または回収する権利を有し、これに伴う一切のリスクはお客様が負担するものとします。また、当社は、自己の裁量により、いつでもお客様のアカウントおよびユーザー名を削除または回収する権利を留保します。
      <br><br>
    </div>
    <div class="T_title">
      2. サービスの範囲
    </div>
    <div class="T_content">
      2.1 ソフトウェアの具体的なサービス内容は実際の状況に応じて提供され、ビデオチャット、仮想ギフトの購入または送信を含みますが、これらに限られません。当社は、自己の裁量により、お客様への事前通知なく、いつでも提供するサービス内容を変更することができます。
      <br><br>
      2.2 お客様は、当社が商業目的のために、電子メール、クライアント、プッシュメッセージ、SMS、ウェブページまたはその他の適法な方法により、販促情報その他の関連する業務情報や通知をお客様に送信する権利を有することを理解し、これに同意するものとします。携帯電話ネットワークの特性上、当社はお客様の携帯電話情報にアクセスする権利を有します。
      <br><br>
    </div>
    <div class="T_title">
      3. ユーザー情報の保護
    </div>
    <div class="T_content">
      3.1 お客様がアカウントを登録し、またはサービスを利用する過程で、法律、規則および規制文書（以下「法令等」といいます）により要求される本人確認情報など、一定の必要情報の入力または提出を求められる場合があります。お客様が提出する情報が不完全、不正確、または法令等に適合しない場合、お客様は当社サービスを利用できない、または利用を制限される場合があります。
      <br><br>
      3.2 本ソフトウェアの品質向上およびサービス提供のため、当社は、技術的手段を通じてお客様の情報を収集または利用し、もしくは第三者に開示する場合があります。詳細については、当社の「プライバシーポリシー」をよくお読みください。
    </div>

    <div class="T_title">
      4. コンテンツ要件および利用ルール
    </div>
    <div class="T_content">
      4.1 本規約における「コンテンツ」とは、お客様が作成、アップロード、複製、公開および配信する一切のコンテンツを指し、アカウントのアバター、氏名、自己紹介等の登録情報および認証情報、またはソフトウェア利用中に送信、返信もしくは自動返信されるテキスト、音声、画像、動画、図形、関連リンクページその他生成されるコンテンツを含みますが、これらに限られません。
      <br><br>
      4.2 お客様は、本ソフトウェアを利用して以下のコンテンツを作成、アップロード、複製または送信し、または以下の行為を行ってはなりません。
      <br><br>
      1) 国家の安全を脅かし、国家機密を漏えいし、国家権力を転覆させ、または国家統一を損なう行為。
      <br><br>
      2) 国家の名誉および利益を害する行為。
      <br><br>
      3) 民族間の憎悪や差別を扇動し、民族の団結を損なう行為。
      <br><br>
      4) 国家の宗教政策を損ない、カルトや封建的迷信を助長する行為。
      <br><br>
      5) デマを流布し、公の秩序を乱し、社会の安定を損なう行為。
      <br><br>
      6) わいせつ、ポルノ、性的内容または性的示唆を含むコンテンツを配信する行為。
      <br><br>
      7) 賭博、暴力、殺人、テロに関するコンテンツを配信する行為。
      <br><br>
      8) 他人を侮辱または中傷し、他人の適法な権利を侵害し、または詐欺行為を行うこと。
      <br><br>
      9) 侮辱的、威嚇的または脅迫的な内容を含むこと。
      <br><br>
      10) 嫌がらせ、スパム、悪意ある情報またはフィッシング情報を含むこと。
      <br><br>
      11) 他人のプライバシー、個人情報または詳細情報を開示し、またはこれに関わること。
      <br><br>
      12) 他人の名誉権、肖像権、知的財産権、営業秘密その他の適法な権利を侵害すること。
      <br><br>
      13) 何らかの方法で未成年者の利益を害すること。
      <br><br>
      14) 他のユーザーをつきまとい、またはその他の方法で嫌がらせを行うこと。
      <br><br>
      15) 虚偽情報を含むこと、または他人のアバターや情報を盗用し、他人の身分で投稿または利用すること。
      <br><br>
      16) 他のユーザーに対し、フォロー、リンクページのクリックまたは情報共有を強要し、または誘導すること。
      <br><br>
      17) 事実を捏造し、真実を隠して他人を誤導または欺罔すること。
      <br><br>
      18) 広告または販売目的の情報を含むこと。
      <br><br>
      19) 技術的手段を用いて複数の偽アカウントを作成すること。
      <br><br>
      20) 本ソフトウェアおよびその複製物上の著作権表示を削除すること。
      <br><br>
      21) ソフトウェアのリバースエンジニアリング、逆コンパイル、逆アセンブルを行い、またはソフトウェアのソースコードを解明しようとすること。
      <br><br>
      22) 当社の知的財産権を含むコンテンツを使用、賃貸、貸与、複製、改変、リンク、転載、編集、配布、公開し、またはミラーサイトを作成すること。
      <br><br>
      23) 当社が公開したデータ、ソフトウェアに必要なデータ、またはそれらの派生物を複製、改変、追加、削除、フックし、または生成すること。
      <br><br>
      24) ソフトウェア内の命令またはデータを改変もしくは改ざんすることにより、ソフトウェアの機能を追加、削除、変更し、または商業目的の有無を問わず、ソフトウェアを運営し、もしくは公衆に送信すること。
      <br><br>
      25) 当社が開発または承認していない第三者ソフトウェア、ハッキングツール、プラグインまたはシステムを通じてソフトウェアにログインまたは利用すること、または当社が開発または承認していない第三者ソフトウェア、プラグイン、ハッキングツールおよびシステムを作成、公開または配布すること。
      <br><br>
      26) 攻撃的、不適切、または不快であると合理的にみなされ得る内容を含むこと。
      <br><br>
      27) 法令、規制文書または政策（お客様の居住地および本ソフトウェアの運営・稼働地の法域を含みます）に違反するその他のコンテンツまたは行為、または第三者の適法な権利利益を侵害し、もしくはソフトウェアの正常な運営を妨害するその他のコンテンツまたは行為。当社は、お客様のアップロード内容を審査し、アップロード後 24 時間以内に結果を通知します。お客様が本アプリを使用して上記内容を作成、アップロード、複製、公開または拡散した場合、当社はお客様が送信したコンテンツを削除する権利を有し、重大な違反がある場合はアカウントを停止します。
      <br><br>
      4.3 お客様が作成、アップロード、複製および送信したいかなるコンテンツも当社とは無関係であり、当社の意見、立場または方針を反映または代表するものではありません。お客様がアップロード、配布、複製、公開したコンテンツ、またはお客様が行った行為について、当社は一切責任を負いません。
      <br><br>
      4.4 お客様は、お客様が送信、作成、アップロード、複製、公開および拡散した情報の真正性、適法性、正確性および有効性、ならびにお客様が行った行為について単独で責任を負うものとします。これに起因するいかなる責任もお客様自身の負担であり、本ソフトウェアとは無関係です。お客様の行為により当社または第三者に損害が生じた場合、お客様は当社または第三者の損害を賠償しなければならず、当社は本規約に従ってお客様の責任を追及する権利を有します。
      <br><br>
    </div>
    <div class="T_title">
      5. 第三者の商品およびサービス
    </div>
    <div class="T_content">
      5.1 本サービスには、第三者が提供する広告およびプロモーションが含まれる場合があり、お客様は、本サービスの利用中にこれらの広告およびプロモーションが表示されることに同意するものとします。法令により別段明示的に定められている場合を除き、お客様は広告情報に基づいて行う取引および当該取引に関する損失について、自ら責任を負うものとします。当社は、前記取引から生じるいかなる責任または損失についても責任を負いません。
      <br><br>
      5.2 お客様が当社ソフトウェア上に表示され、またはリンクされた第三者提供のサービスもしくは商品を利用することを選択した場合、お客様は、当該第三者の規約およびポリシーに従わなければなりません。当社は、第三者サービスの安全性、正確性または有効性を保証することはできず、第三者のサービス、商品または行為に起因してお客様に生じた損失について責任を負いません。
    </div>
    <!-- <div class="T_title">
      6. 会員
    </div>
    <div class="T_content">
      6.1 お客様は会員サービスを購入することができ、含まれるサービス内容および価格情報は、本サービスの関連サービスページに表示される内容に従うものとします。
      <br><br>
      6.2 当社は、関連ページに改訂版を表示することにより、会員サービスの料金基準および内容をいつでも調整することができます。
      <br><br>
      6.3 法令により明確に定められている場合を除き、支払い完了後は、いかなる状況においても譲渡または返金は認められません。お客様が有料サービスで定められた有効期間内に本サービスを利用しなかった場合、サブスクリプション終了後に本サービスは自動的に終了し、中断または延期することはできません。
      <br><br>
      6.4 会員登録時に提出した内容および個人情報は、有効かつ真実でなければなりません。必要な場合、お客様は登録した個人情報を修正しなければならず、そうしないことにより会員としての権利を十分かつ有効に行使できなかった結果については、お客様が責任を負うものとします。
      <br><br>
    </div>
    <div class="T_title">
      7. サブスクリプションおよび仮想通貨
    </div>
    <div class="T_content">
      7.1 サブスクリプション
      お客様は、1 か月、2 か月、3 か月に応じた異なるサブスクリプションパッケージを購入することができます。
      すべてのモバイルサブスクリプションについて、購入確認時に料金はお客様の iTunes または Google アカウントから差し引かれます。
      現在のサブスクリプション期間終了の少なくとも 24 時間前までに自動更新機能をオフにしない限り、お客様のサブスクリプションは自動更新されます。これは、現在のサブスクリプション期間終了前 24 時間以内に、お客様のアカウントに更新料金が請求される可能性があるためです。お客様は、iTunes または Google アカウント設定にアクセスすることにより、サブスクリプションを管理し、自動更新をオフにすることができます。サブスクリプション期間中は現在のサブスクリプションを解約することはできませんが、自動更新はいつでも解除することができます。
      <br><br>
      サブスクリプションの購入は、たとえ期限切れまたは終了した場合であっても、返金不可かつ譲渡不可です。当社は、サブスクリプションの購入価格およびサブスクリプションに含まれる機能をいつでも変更することができます。当社は、サブスクリプションの提供および申込みを停止し、サブスクリプションの有効期限をいつでも設定する権利を留保します。サブスクリプションは、いかなる金額または通貨価値とも交換することはできません。
      <br><br>
      7.2 仮想通貨
      お客様がダイヤモンドなどの仮想通貨商品を購入または受領した場合でも、お客様がそれらを所有するものではありません。ダイヤモンドは、ストーリーのアップロード、フィルターの使用、ビデオチャット機能の利用などに使用されます。お客様は、コインその他の仮想通貨に関する当社の権利行使に基づいて、当社がお客様に対して何ら責任を負わないことに同意するものとします。当社は、お客様の本人確認および仮想通貨利用資格を確認する権利を留保します。
      <br><br>
      当社が仮想通貨またはストーリーを変更、一時停止もしくは終了した場合、またはサービスエラーその他の理由により損失もしくは損害が発生した場合であっても、当社は仮想通貨の修復または交換を行わず、いかなるクレジットまたは返金も提供しません。
      仮想通貨の購入は、たとえ期限切れ、取消しまたは終了となった場合であっても、再許諾不可、返金不可および譲渡不可です。当社は、仮想通貨の購入価格および仮想通貨の利用方法をいつでも変更することができます。
      当社は、通知、返金または補償なしに、いつでも仮想通貨の発行を取り消しまたは停止し、仮想通貨の有効期限を設定する権利を留保します。仮想通貨はいかなる金銭または金銭的価値とも交換することはできません。お客様がアカウントを削除した場合、またはお客様のアカウントが何らかの理由で終了した場合、お客様は、返金その他の補償なく、蓄積された未使用の仮想通貨をすべて失うものとします。
      お客様は、仮想通貨に関する当社の権利行使に基づいて、当社がお客様に対して何ら責任を負わないことに同意するものとします。
      いずれのユーザーが購入または受領した仮想通貨も財産を構成せず、譲渡することはできません。
      <br><br>
      7.3 支払方法
      当社の有料サービス
      当社の有料サービスは、お客様の Apple iTunes アカウントまたは Google Play アカウントなど、一部の第三者のアカウント（以下「第三者アカウント」）を通じて購入することができます。お客様が第三者アカウントを通じて有料サービスを購入した場合、当該有料サービスの請求は第三者アカウントを通じて表示されます。当社が管理していない第三者アカウントについては、その利用規約を確認してください。
      <br><br>
      7.4 解約
      お客様が第三者アカウントを通じてサブスクリプションを購入した場合、お客様は当該第三者を通じて、かつその第三者の利用規約に従ってサブスクリプションを解約する必要があります。お客様がサブスクリプションを解約した場合、その特典は当時のサブスクリプション期間の終了まで継続しますが、その期間満了後は更新されません。お客様は、当時のサブスクリプション期間について支払済みの料金のいかなる部分についても、日割り返金を受ける権利を有しません。
      <br><br>
      7.5 期間/料金
      本規約は、お客様がモバイルアプリケーション、ウェブサイトおよび/または本サービスを利用している間、完全に有効に存続します。当社は、理由のいかんを問わず、いつでも通知なくお客様の会員資格を終了することができます。当社が本サービスにおけるお客様の会員資格を終了した場合、お客様は、未使用のサブスクリプション料金の返金を受ける権利を有しません。会員資格が終了した後も、本規約は引き続き有効に存続します。登録時にお客様に提示された当社サービスの利用規約および/またはサブスクリプション料金は、必要に応じて変更される場合があります。本サービスを利用し会員となることにより、お客様は、当社が本サービスに対して料金を請求する権利を留保し、会員が本規約に違反した場合、または本規約に基づき必要な場合にサービス料金を支払わなかった場合には、当該会員の会員資格を終了する権利を当社が有することを認めるものとします。SMS、MMS その他のデータ通信に関する通常の利用料金が適用される場合があり、これらはお客様の通信料金請求書に請求されるか、前払い残高から差し引かれる場合があります。
      <br><br>
    </div> -->
    <div class="T_title">
      6. データ保存
    </div>
    <div class="T_content">
      6.1 当社は、本サービスにおけるお客様のデータの削除または保存失敗について責任を負いません。
      <br><br>
      6.2 当社は、さまざまな要素に基づき、本サービスにおけるお客様のデータの最大保存期間および保存容量を決定することができます。お客様は、ご自身の必要に応じて本サービスに関するデータをバックアップすることができます。
      <br><br>
      6.3 お客様が本サービスの利用を中止した場合、または本サービスが終了もしくは停止された場合、当社は当社サーバーからお客様のデータを恒久的に削除することができ、当社はお客様にいかなるデータも返還する義務を負いません。
      <br><br>
      6.4 お客様は、ご自身の個人データ、登録情報およびお客様がアップロードまたは配信したコンテンツを修正または削除することができます。関連情報を削除すると、システムに保存されたコンテンツも削除されることにご注意ください。このリスクについては、お客様が責任を負うものとします。
      <br><br>
    </div>
    <div class="T_title">
      7. リスク
    </div>
    <div class="T_content">
      7.1 お客様は、本ソフトウェアが情報共有および情報伝達のためのプラットフォームを提供するにすぎないことを理解し、これに同意するものとします。お客様は、ご自身のアカウントにおいて行われるすべての行為（送信するあらゆるコンテンツおよびその結果を含みます）について責任を負います。お客様は、ソフトウェアおよびサービスのコンテンツを自ら判断し、サービスの利用により生じるすべてのリスク（コンテンツの正確性、完全性または有用性への依拠により生じるリスクを含みます）を負担するものとします。当社は、お客様の行為により生じた損失について責任を負わず、また責任を負うことはありません。
      <br><br>
      7.2 本規約に違反する者または本サービスをその他不適切な方法で利用する者を発見した場合は、直ちに当社にお知らせください。当社は本規約に従って対応します。
      <br><br>
      7.3 お客様は、当社が各種事情に応じて、自己の裁量により、本サービスの全部または一部の機能を事前通知なく変更、一時停止、終了または更新する権利を留保することを理解し、これに同意するものとします。
      <br><br>
    </div>
    <div class="T_title">
      8. 知的財産権
    </div>
    <div class="T_content">
      8.1 お客様は、当社サービスに関する知的財産権（広告主が提供し所有するコンテンツを除きます）が当社に帰属することを認めるものとします。ただし、お客様が当社サービスを利用する前に、当社ソフトウェア上にお客様が投稿したコンテンツについて適法に知的財産権を取得している場合はこの限りではありません。
      <br><br>
      8.2 別段の定めがない限り、本ソフトウェアの著作権、特許権その他の知的財産権は当社に帰属します。
      <br><br>
      8.3 本サービスに含まれる図形、テキストまたはその構成要素に関する著作権もしくは商標権、ならびにその他のソフトウェアロゴ、製品名およびサービス名（以下総称して「ソフトウェアロゴ」といいます）は当社に帰属します。お客様は、当社の事前の書面による同意なく、いかなる方法によってもソフトウェアロゴを表示または使用してはならず、また、ソフトウェアロゴを表示し、使用し、または変更する権利を有する旨を他者に示してはなりません。
      <br><br>
      8.4 上記およびその他当社または関連広告主が保有する知的財産権は法令により保護されており、お客様は、当社または関連広告主の書面による許可なく、いかなる形式でもこれらを使用し、または二次的著作物を作成してはなりません。
      <br><br>
      8.5 当社とお客様またはお客様の代理人との間で書面による別段の合意がない限り、お客様は、テキスト、画像、動画、音声、写真等、お客様がアップロードしたコンテンツに関する知的財産権を保有します。ただし、お客様は、当社および当社の関連会社に対し、前記コンテンツを商業目的または非商業目的で使用、表示および複製するための、取消不能、永続的、独占的、ロイヤリティフリー、全世界的かつ再許諾可能な権利を付与することに同意するものとします。これには、翻案、表示、放送、賃貸、複製、撮影、翻訳、インターネット上への掲載等が含まれますが、これらに限られません。当社は、自己の裁量により、当該情報を当社が運営するあらゆるプラットフォーム上で利用および拡散し、当該情報を編集し、第三者にその利用、編集および拡散を許諾することを含め、使用の有無および使用方法を選択することができます。
    </div>
    <div class="T_title">
      9. 責任
    </div>
    <div class="T_content">
      9.1 お客様が違法行為、不当行為、債務不履行または不法行為を行った場合、当社は自己の裁量により、以下の措置の一部または全部を講じる権利を有します。警告の付与、一部機能の利用停止、ソフトウェアへのアクセス終了、ブラックリストへの登録、違反行為の公表、仮想アイテムおよび仮想収益の全部または一部の控除もしくは留保等です。当社がアカウント終了またはブラックリスト登録等の措置を講じた場合、当社はお客様の仮想アイテムおよび収益を返金しない権利を有します。 <br><br>
      9.2 お客様は、当社が、お客様の違法行為、不当行為、債務不履行または不法行為に対して、救済措置および適切な法的措置を講じ、法令に従って関係当局に関連情報を開示する権利を有することを理解し、これに同意するものとし、その結果についてはお客様が責任を負うものとします。
      <br><br>
      9.3 お客様は、本規約違反に起因して生じる損失、損害または第三者からの請求について、合理的な弁護士費用を含め、これを負担することを理解し、同意するものとします。
      <br><br>
      9.4 お客様は、お客様による本サービスへのアクセスまたは利用、本規約違反に起因して発生するあらゆる苦情、要求、請求、損害、損失、費用、責任および支出（弁護士費用を含みますが、これに限られません）について、当社および当社の関連会社を補償し、防御し、免責することに同意するものとします。
      <br><br>
      9.5 当社は、前記救済措置を単独で、または併せて適用することを選択する権利を有します。
      <br><br>
    </div>
    <div class="T_title">
      10. 不可抗力およびその他の免責事項
    </div>
    <div class="T_content">
      10.1 お客様は、本サービスの利用中に、当社の管理の及ばない問題に直面し、それにより本サービスが中断される場合があることを理解し、認識するものとします。洪水、地震、疫病、暴風雨などの自然災害、戦争、騒乱、政府措置などの社会的事象のように、当社の管理および合理的予測の範囲を超えるサービス停止、問題または損失について、当社は責任を負いません。前記の事象が発生した場合、当社は最善を尽くして協力し、適時に修復するよう努めます。
      <br><br>
      10.2 当社は、本サービスが常に安全であり、信頼でき、利用可能であり、中断されず、エラーがなく、遅延しないことについて、いかなる約束または保証も行いません。適用法により認められる最大限の範囲で、当社は、本サービスに関して、明示または黙示を問わず、いかなる種類の保証、条件その他の条項も行いません。当社は、権原、不侵害、商品性、平穏享有または特定目的適合性に関するいかなる保証、条件その他の条項も否認します。当社は、お客様その他の者の行為を管理または操作するものではなく、また、オンラインかオフラインかを問わず、それらの者のコンテンツおよびそれらが共有するいかなるコンテンツ（攻撃的、不適切、わいせつ、違法、その他論争のある内容を含みます）についても責任を負いません。
      <br><br>
      10.3 多くのインターネットサービスと同様に、当社サービスは、インターネットサービスの品質、社会環境、またはお客様がダウンロード、インストール、閲覧する他のソフトウェアやウェブサイトに含まれる「トロイの木馬」等のウイルスなど、さまざまなセキュリティ問題の影響を受ける場合があります。これらはお客様のコンピュータ情報およびデータの安全を脅かし、その結果、本サービスの正常な利用に影響を及ぼすことがあります。お客様は、情報セキュリティおよびユーザーデータの保護を強化し、損失や嫌がらせを防ぐため、パスワード保護の強化に注意を払う必要があります。
      <br><br>
      10.4 お客様は、本サービスが、不可避の問題、コンピュータウイルスまたはハッキング、システム不安定、お客様の所在地、お客様の端末の電源断、その他の技術的問題、インターネット問題、通信事業者の問題等により中断される場合があることを理解し、認識するものとします。当社は、前記中断により生じたいかなる損失についても責任を負いません。
      <br><br>
      10.5 お客様は、本サービスの利用過程において、誤解を招く情報、欺瞞的な情報、脅迫的な情報、名誉毀損的な情報、攻撃的な情報、違法な情報、または他人の権利を侵害する情報が存在し得ることを理解し、認識するものとします。当社は、前記情報または行為によりお客様または第三者に生じたいかなる損失についても一切責任を負いません。
      <br><br>
      10.6 お客様は、当社が定期的または不定期に、本ソフトウェアの機能を保守、更新および修復する場合があることを理解し、認識するものとします。当社が事前に通知したうえで、そのような事情により合理的な期間サービスが中断された場合、当社はこれについて責任を負いません。
      <br><br>
      10.7 法令に別段の定めがない限り、当社は、第三者による債務不履行、不法行為または違法行為に対応する権利を有しますが義務を負うものではなく、また、前記第三者による債務不履行、不法行為または違法行為が適時に発見または処理されることを保証することはできません。
      <br><br>
      10.8 お客様は、当社が、お客様に提供される商品またはサービスの品質上の欠陥、およびお客様に無償で贈与された商品またはサービスによって生じた損害について責任を負わないことを理解し、認識するものとします。
      <br><br>
      10.9 本規約に別段の定めがある場合であっても、お客様は、当社が、サービスの利用または利用不能に起因または関連して生じるいかなる間接損害、付随損害、特別損害、懲罰的損害または結果損害（逸失利益、営業権またはデータの喪失を含みます）についても責任を負わないこと、また、本サービスの他のユーザーおよび外部サイト運営者を含む第三者の行為についても責任を負わないことを認めるものとします。さらに、いかなる方式または理由によるものであっても、すべての補償、救済および責任の総額は、お客様が当社に支払ったすべての料金（該当する場合）を超えないものとします。
      <br><br>
      10.10 お客様は、オフラインまたは本プラットフォーム外で他のユーザーと会い、取引を行う場合、人身および財産の安全、ならびに取引紛争のリスクが存在し得ることを理解し、認識するものとします。当社は、前記リスクまたは損失について責任を負わず、すべての責任はお客様が負うものとします。
      <br><br>
    </div>
    <div class="T_title">
      11. その他
    </div>
    <div class="T_content">
      11.1 当社は、お客様に対し、本規約、特に免責、リスク、お客様の権利の制限および当社の責任に関する条項をよく読むよう求めます。お客様が未成年者である場合は、保護者の同伴のもとでお読みください。
      <br><br>
      11.2 お客様は、当社がソフトウェア上で公表するその他の声明およびルールが、本規約の補足としてみなされ、本規約の不可分の一部を構成し、本規約と同等の法的効力を有することを理解し、これに同意するものとします。
      <br><br>
      11.3 本規約は、香港特別行政区の法律に準拠し、同法に従って解釈されるものとします。本規約に起因し、または本規約に関連して生じる一切の紛争（本規約の存在、有効性または終了に関する問題を含みます）は、香港国際仲裁センターによる仲裁規則に従う仲裁に付され、最終的に解決されるものとします。
      <br><br>
      11.4 本規約のいずれかの条項が無効または執行不能であっても、その他の条項の有効性または執行可能性には何ら影響を及ぼしません。本規約のいずれかの条項が管轄当局により無効または執行不能と判断された場合、各当事者は、元の条項の商業的目的を実質的に実現するため、代替条項について合意するべく最善の努力を尽くすものとします。
      <br><br>
    </div>
  </div>
</template>

<style  scoped>
  .agreement {
    padding: 0px 25px;
    font-size: 14px;
    margin-bottom: 14px;
    color: #666666;

    background-color: #fff;
  }
  .T_title {
    font-size: 18px;
    font-weight: 600;
    margin: 1rem 0px;
    color: #666666;
  }
  .T_content {
    font-size: 14px;
    margin-bottom: 12px;
    /* color: #666; */
  }
  .title_content {
    font-size: 12px;
    margin-bottom: 12px;
    color: #666;
    margin-left: 12px;
    margin-right:12px;
  }
</style>
